{
  "experience": [
    {
      "id": "1",
      "title": "Ingeniero de Mecatrónica",
      "location": "Smart Solutions ingeniería Spa",
      "date": "Abril 2024 - Actualidad",
      "description": [
        "Diseñé y desarrollé un robot móvil autónomo para funciones de seguridad, integrando navegación autónoma, teleoperación web y gestión de alertas.",
        "Implementé algoritmos de planificación de rutas y control en tiempo real con C++, Python y ROS",
        "Programé microcontroladores ESP32, Jetson Nano y Raspberry Pi con gestión de errores y prioridades.",
        "Desarrollé una aplicación web full-stack integrada con el robot móvil, usando React, TypeScript, FastAPI y MySQL para monitoreo en tiempo real, autenticación, gestión de rutas y visualización de registros de patrullaje.",
        "Implementé y configure servidores VPN para el control del robot móvil y para un sistema de conserjería remota de múltiples edificios, conectando citofonia, accesos y cámaras IP."
      ]
    }
  ],
  "academic": [
    {
      "id": "2",
      "title": "Curso desarrollo full stack",
      "location": "Full Stack Open, Online",
      "date": "2024",
      "description": [
        "Desarrollo centrado al uso de ReactJS y NodeJs, incluyendo testing con PlayWright, base de datos no relacional con MongoDB y manejo de estados avanzado con Redux."
      ]
    },
    {
      "id": "1",
      "title": "Ingenieria Civil en Mecatrónica",
      "location": "Universidad de Talca, Curicó",
      "date": "2018 - 2024",
      "description": [
        "Titulado con honores y el mejor de la generación del año 2024.",
        "Mi proyecto de titulación fue ''Sistema de localización en interiores basado en fusión de sensores para robot guía'', en el cual utilicé Xbee, IMU y odometría para realizar la localización.",
        "Adicionalmente desarrollé el prototipo de Robot Guía de personas para un espacio cerrado, considerando mapeo, navegación y la interfaz humano-robot con el usuario a través de una tablet. Se trabajó con Python, C++ y ROS."
      ]
    }
    
  ],
  "projects": [
    {
      "id": "4",
      "idRouter": "puma-robot",
      "title": "Robot de seguridad",
      "description": [
        "Robot móvil autónomo para funciones de seguridad, con navegación autónoma, teleoperación web y gestión de alertas.",
        "Desarrollado con C++, Python y ROS, integrando microcontroladores ESP32, Jetson Nano y Raspberry Pi.",
        "Incluye planificación de rutas, control en tiempo real y enlace con aplicación web full-stack para monitoreo y gestión.",
        "Implementa conexión VPN para configuración remota."
      ],
      "skills": ["cpp", "python", "ros"],
      "img": ["/puma/puma-1.webp", "/puma/puma-2.webp", "/puma/puma-3.webp"]
    },
    {
      "id": "3",
      "idRouter": "puma-app",
      "title": "Interfaz web robot seguridad",
      "description": [
        "App para el control de un robot a través de internet. Entre las funcionalidades se encuentra: autenticación, monitoreo del estado del robot, gestión de rutas para navegación, manejo de servicios del robot y control teleoperado del robot.",
        "Proyecto full stack, con frontend en React/Typescript y backend en FastAPI con base de datos MySQL."
      ],
      "skills": ["html", "css", "typescript", "react", "fastapi", "mysql"],
      "img": ["/webpuma/webpuma-1.webp", "/webpuma/webpuma-2.webp", "/webpuma/webpuma-3.webp", "/webpuma/webpuma-4.webp", "/webpuma/webpuma-5.webp", "/webpuma/webpuma-6.webp"]
    },
    {
      "id": "2",
      "idRouter": "study-streak",
      "title": "Study Streak",
      "description": [
        "App enfocada para el autoestudio con flashcards gamificadas: Revisión clásica, múltiple, inversa, y competencia contra bot con 3 niveles de dificultad.",
        "Desarrolada React + Redux con Material-UI y LocalStorage. Utiliza solo frontend, contiene estadísticas y progreso persistentes en JSON, con importación y exportación de los datos.",
        "Hice uso de Redux para el manejo del estado global de las flashcards y estadísticas."
      ],
      "skills": ["html", "css", "javascript", "react"],
      "url": "https://github.com/nicolasnna/study-streak",
      "img": ["/studystreak/studystreak-1.webp", "/studystreak/studystreak-2.webp", "/studystreak/studystreak-3.webp", "/studystreak/studystreak-4.webp", "/studystreak/studystreak-5.webp"],
      "deployUrl": "https://nicolasnna.github.io/study-streak/"
    },
    {
      "id": "1",
      "idRouter": "webmusic",
      "title": "WebMusic",
      "description": [
        "Web para descarga de música de Youtube y Spotify.",
        "Este proyecto emplea consumo de APIs obtenidas de RapidAPI para busqueda de información y descarga."
      ],
      "skills": ["python", "reflex"],
      "img": "/preview_webmusic.webp",
      "url": "https://github.com/nicolasnna/webmusic-reflex-project"
    }
  ],
  "featured": [
    {
      "id":"1",
      "idRouter": "puma-app",
      "title": "Interfaz web robot seguridad",
      "description": "Aplicación web para el control de un robot móvil autónomo, con funcionalidades de monitoreo, gestión de rutas y teleoperación.",
      "img": "/webpuma/webpuma-3.webp"
    },
    {
      "id": "2",
      "idRouter": "study-streak",
      "title": "Study Streak",
      "description": "Aplicación de autoestudio con flashcards gamificadas, que permite revisar, competir y seguir el progreso del usuario.",
      "img": "/studystreak/studystreak-1.webp"
    },
    {
      "id": "3",
      "idRouter": "puma-robot",
      "title": "Robot de seguridad",
      "description": "Robot móvil autónomo para funciones de seguridad, con navegación autónoma y teleoperación web.",
      "img": "/puma/puma-1.webp"
    }
  ]
}

